#第六章  对象(object)
##什么是对象：
#        对象是内存中专门用来存储数据的一块区域。
#        对象中可以存放各种数据(比如：数字、布尔值、代码)
#        对象由三部分组成：
                   1.对象的标识（id）
                   2.对象的类型（type）
                   3.对象的值 (value)
##面向对象（oop）
#   -python是一门面向对象的语言
#   -就是Python中的所有操作都是通过对象来进行的
#   -与之相对应的是面向过程的编程语言
#          -指的是将我们程序的逻辑分解为一个一个的步骤，通过对每个步骤的抽象，
#            来完成程序
#  -面向过程的编程思想将一个功能分解成一个一个小的步骤，通过完成一个一个小的
#步骤来完成一个程序
#但这种方式编写的代码往往只适用于一个功能，复用性比较低。
#-这种编程方式符合人类的思维习惯，编写起来相对简单。


##面向对象的编程语言：
#      面向对象的编程语言，关注的是对象，而不关注过程
#      对于面向对象的语言来说，一切都是对象	
#面向对象的编程思想，将所有的功能统一保存到对应的对象中，要使用某个功能，直接
#找到对应的对象即可。
#-这种方式编写的代码比较容易阅读，并且易于维护。


##简单归纳面向对象思想
   #1、找对象  2、搞对象


##类(class)
#类：简单理解相当于一个图纸。在程序中我们需要根据类来创建对象。
#类就是对象的图纸！也称对象是类的实例(instance)
#如果多个对象是通过一个类创建的，我们称这些对象是一类对象
#自己定义的类都需要使用大写字母开头，使用大驼峰命名法（帕斯卡命名法）来对类命名
