#任务一：向文件输出内容的两种方式：

# fp=open('C:\\Users\\xianyu\\Desktop\\奋斗.txt','a+')
# print('奋斗成就更好的你！',file=fp)
# fp.close()

# with open('C:\\Users\\xianyu\\Desktop\\奋斗.txt','a+') as fp:
# 	fp.write('奋斗成就更好的你！')
#-----------------------------------------------------------------

#任务二：输出北京天气预报
# print('星期四','今天')
# print('-'*60)
# print('08时','11时','14时','17时','20时','23时')
# print('10℃','13℃','17℃','15℃','14℃',' 8℃')
# print('-'*60)
# print('明天','      4/23','   23℃/14℃')
# print('星期六','    4/24','   22℃/13℃')
# print('星期日','    4/25','   21℃/12℃')
# print('星期一','    4/26','   20℃/10℃')
# print('星期二','    4/27','   24℃/12℃')
# print('星期三','    4/28','   25℃/12℃')

#------------------------------------------------------------------

