#输出《红楼梦》在金陵十二钗前五位
#方法一：变量的赋值
# name1='林黛玉'
# name2='薛宝钗'
# name3='贾元春'
# name4='贾探春'
# name5='史湘云'
# print('①'+name1)
# print('②'+name1)
# print('③'+name1)
# print('④'+name1)
# print('⑤'+name1)
#-------------------------------------------------------------------
#方式2,列表的方式
# last_name=['林黛玉','薛宝钗','贾元春','贾探春','史湘云']
# sig_name=['①','②','③','④','⑤']
# for i in range(5):
# 	print(sig_name[i],last_name[i])

#------------------------------------------------------------------
#方式3.字典的方式：
# lit={'①':'林黛玉','②':'薛宝钗','③':'贾元春','④':'贾探春','⑤':'史湘云'}

# for key in lit:
# 	print(key,lit[key])
#------------------------------------------------------------------
#方式4.
# last_name=['林黛玉','薛宝钗','贾元春','贾探春','史湘云']
# sig_name=['①','②','③','④','⑤']

# for s,name in zip(sig_name,last_name):
# 	print(s,name)




#------------------------------------------------------------------
#------------------------------------------------------------------
#案例三：将指定的十进制数转换成二进制、八进制、十六进制
# num=int(input('请输入一个十进制的整数'))
# print(f'{num}的二进制数是：{bin(num)}')
# print('%s的二进制数是%s'%(num,bin(num)))
# print('{0}的二进制数是：{1}'.format(num,bin(num)))
# print(f'{num}的八进制数是：{oct(num)}')
# print(f'{num}的十六进制数是：{hex(num)}')



#------------------------------------------------------------------
#------------------------------------------------------------------
#案例四：支付密码的验证（只允许有数字）
# pwd=input('支付宝支付密码：')
# if pwd.isdigit():
# 	print('支付数据合法')
# else:
# 	print('支付数字不合法，支付密码只能是数字')  
#-----------------------------------------------------------------
#方法2：
# pwd=input('支付宝支付密码：')
# print('支付密码合法'  if pwd.isdigit() else '支付数字不合法，支付密码只能是数字')

#------------------------------------------------------------------
#------------------------------------------------------------------
#模拟QQ账号登录
# qq=input('请输入你的QQ号：')
# pwd=input('请输入你的密码：')
# if qq=='1297420404'and pwd=='xianyu129742040':
# 	print('登录成功')
# else:
# 	print('对不起，账号或密码不正确！')

#------------------------------------------------------------------
#------------------------------------------------------------------
#价格竞猜
# import random
# price=random.randint(1000,1500)
# print('今日竞猜的商品为小米扫地机器人，价格在1300-1500之间')
# while True:
# 	guss=int(input('请输入竞猜价格->'))
# 	if guss>price:
# 		print('大了')
# 	elif guss<price:
# 		print('小了')
# 	else:
# 		print('猜对了') 
# 		break

#-------------------------------------------------------------------
#-------------------------------------------------------------------
#循环输出26个字母的ASCII码值
# x=97  #97是a的ASCII码
# for _ in range(26):
# 	print(f'{chr(x)}->{x}')
# 	x+=1
#-------------------------------------------------------------------
#-------------------------------------------------------------------

#模拟用户登录，用户名为admin，密码为8888，只有三次机会

# username='admin'
# passcode='8888'
# a=2
# for i in range(3):
# 	user=input('请输入用户名->')
# 	code=input('请输入密码->')
# 	if user==username and code==passcode:
# 		print('登录成功')
# 		break
# 	elif a!=0:
# 		print(f'你还有{a}次机会')
# 		a-=1
# 	elif a==0:
# 		print('对不起，三次均输入错误，请联系管理员')
# 		break
#-------------------------------------------------------------------
