#创建一个列表
stus=['孙悟空','猪八戒','沙和尚','唐僧','蜘蛛精','白骨精',]

# +和*
#my_list=[1,2,3]+[4,5]
# + 可以将两个列表拼接为一个列表
#* 可以将列表重复指定的次数
#my_list=[1,2,3]*2

# in 和 not in
#in用于检查指定元素是否存在于列表中，如果存在返回True,否则返回False
#not in 用于检查指定元素是否不在列表中
#如果不在返回True,否则返回False
#min()获取列表中的最小值
#max()获取列表中的最大值
#arr=[1,3,4,5,6,7,8,8,3,5,5]
#print(max(arr),min(arr))
#两个方法(method)，方法和函数基本一致，只不过方法必须通过 对象.方法()的形式调用
#xxx.print()方法实际上就是和对象关系紧密的函数
#s.index() 获取指定元素在列表中第一次出现的位置 如：stus.index('孙悟空')
#index()的第二个参数，表示查找的起始位置，第三个参数表示查找的结束位置
#如果要获取列表中没有的元素的索引，会抛出异常
#s.count() 统计指定元素在列表中出现的次数
